loop-recursion.org
#+TITLE:        Loop and Recursion
#+AUTHOR:       Pedro Chinen
#+EMAIL:        ph.u.chinen@gmail.com
#+DATE-CREATED: [2018-01-21 Sun]
#+DATE-UPDATED: [2018-01-21 Sun]


* References
https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html


* RECURSION
https://www.gnu.org/software/emacs/manual/html_node/eintr/Recursion.html#Recursion

Recursão é um estilo de programação no qual uma função chama ela
mesma com outros parametros para com o intuito de fazer um
loop. É muito importante que os parametros das chamdas da função
sejam diferentes umas das outras de forma a levar o programa a
parar. Caso contrário ele ficará executando as mesmas intruções
sem fim.


* WHILE
https://www.gnu.org/software/emacs/manual/html_node/eintr/while.html#while

(while 'test 'body)
Testa se TEST returna um valor não nulo. Executando BODY e repetindo.
A ordem da execução é TEST, BODY, TEST, BODY e assim por diante.]
Até que TEST retorne nulo.

* DOTIMES
https://www.gnu.org/software/emacs/manual/html_node/eintr/dotimes.html#dotimes

* DOLIST
https://www.gnu.org/software/emacs/manual/html_node/eintr/dolist.html#dolist

* Loop
https://www.gnu.org/software/emacs/manual/html_node/cl/Loop-Facility.html#Loop-Facility




